# арифметические операции(+  -  *  /  %)

print(5 + 3) # сложение
print(10 - 4) # вычитание
print(6 * 2) # умножение
print(12 / 3) # деление
print(12 % 5) # остаток от деления




# условные операции(>  <  <=  =>  ==  !=)

print(5 > 3) # больше
print(5 < 3) # меньше
print(5 <= 3) # меньше равно
print(5 >= 3) # больше равно
print(5 == 3) # равно
print(5 != 3) # не равно




# логические операции(and  or  not)

# если один хотя бы неправильный - False. В остальном True
print(5 > 3 and 4 > 5 and 2 > 1 and 10 > 0) 

# если один хотя бы правильный - True. В остальном False
print(5 > 3 or 4 > 5 or 2 > 1 or 10 > 0) 

print(not 5 > 10) # отрицание